/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TafAgent.h
  版 本 号   : 初稿
  作    者   : c00173809
  生成日期   : 2011年12月19日
  最近修改   :
  功能描述   : TafAgent.c的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2011年12月19日
    作    者   : c00173809
    修改内容   : 创建文件

******************************************************************************/

#ifndef _TAFAGENT_H_
#define _TAFAGENT_H_

/*****************************************************************************
  1 头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "MnCallApi.h"
#include  "MnErrorCode.h"
#include  "MnClient.h"
#include "TafAgentInterface.h"

#pragma pack(4)


#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define  PS_SYNC_CNF_TIMEOUT_LEN                    (5000)

/*****************************************************************************
  3 全局变量定义
*****************************************************************************/
/* Added by z60575 for DTS2013120505956,2014-1-10 begin */
#define TAF_AGENT_TASK_PRIORITY                     (84)
/* Added by z60575 for DTS2013120505956,2014-1-10 begin */

/*****************************************************************************
  4 函数实现
*****************************************************************************/
/* Added by f00179208 for DTS2013021700415, 2013-02-17,  Begin */
extern VOS_UINT32 TAF_AGENT_PidInit(enum VOS_INIT_PHASE_DEFINE enPhase);
extern VOS_VOID TAF_AGENT_ProcMsg(MsgBlock* pstMsg);
/* Added by f00179208 for DTS2013021700415, 2013-02-17,  End */

#ifdef DMT
extern VOS_UINT32 DMT_GetSysMode(TAF_AGENT_SYS_MODE_STRU *pstSysMode);
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif

